package paper;

/**
 * 岗位数计算
 *
 * @author zhouhao
 * @date 2024/12/1 20:20
 */
public class tmp2 {
    public static void main(String[] args) {
        int sum1 = 0;
        String[] data1 = getData1().split("\n");
        for (String data : data1) {
            int index = data.length() - 1;
            int num = 0;
            int carry = 1;
            while (index >= 0 && Character.isDigit(data.charAt(index))) {
                num += (Integer.parseInt(String.valueOf(data.charAt(index))) * carry);
                index--;
                carry *= 10;
            }
            sum1 += num;
//            System.out.println(num);
        }
        System.out.println("行业总数：" + sum1);


        int sum2 = 0;
        String[] data2 = getData2().split("\n");
        for (String data : data2) {
            if (Character.isDigit(data.charAt(0))) {
                sum2 += Integer.parseInt(data);
//                System.out.println(Integer.parseInt(data));
            }
        }
        System.out.println("地区总数：" + sum2);

    }

    private static String getData2() {
        return "阿尔泰地区\n" +
                "69\n" +
                "阿穆尔州\n" +
                "58\n" +
                "阿尔汉格尔斯克州\n" +
                "1\n" +
                "阿斯特拉罕地区\n" +
                "13\n" +
                "别尔哥罗德地区\n" +
                "10\n" +
                "布良斯克州\n" +
                "5\n" +
                "弗拉基米尔地区\n" +
                "9\n" +
                "伏尔加格勒地区\n" +
                "21\n" +
                "沃洛格达地区\n" +
                "3\n" +
                "沃罗涅日州\n" +
                "25\n" +
                "顿涅茨克人民共和国\n" +
                "1\n" +
                "犹太自治区\n" +
                "2\n" +
                "外贝加尔地区\n" +
                "29\n" +
                "伊尔库茨克地区\n" +
                "81\n" +
                "加里宁格勒地区\n" +
                "8\n" +
                "卡卢加地区\n" +
                "18\n" +
                "堪察加地区\n" +
                "4\n" +
                "克麦罗沃州\n" +
                "38\n" +
                "基洛夫地区\n" +
                "5\n" +
                "科斯特罗马地区\n" +
                "1\n" +
                "克拉斯诺达尔地区\n" +
                "61\n" +
                "克拉斯诺亚尔斯克地区\n" +
                "53\n" +
                "库尔干地区\n" +
                "3\n" +
                "库尔斯克地区\n" +
                "7\n" +
                "L\n" +
                "列宁格勒地区\n" +
                "45\n" +
                "利佩茨克州\n" +
                "11\n" +
                "卢甘斯克人民共和国\n" +
                "1\n" +
                "中号\n" +
                "马加丹地区\n" +
                "1\n" +
                "莫斯科\n" +
                "1379\n" +
                "莫斯科地区\n" +
                "241\n" +
                "摩尔曼斯克州\n" +
                "2\n" +
                "下诺夫哥罗德州\n" +
                "45\n" +
                "诺夫哥罗德地区\n" +
                "2\n" +
                "新西伯利亚地区\n" +
                "152\n" +
                "关于\n" +
                "鄂木斯克地区\n" +
                "38\n" +
                "奥伦堡地区\n" +
                "22\n" +
                "奥廖尔地区\n" +
                "6\n" +
                "磷\n" +
                "奔萨地区\n" +
                "7\n" +
                "彼尔姆地区\n" +
                "48\n" +
                "滨海边疆区\n" +
                "144\n" +
                "普斯科夫州\n" +
                "9\n" +
                "右\n" +
                "巴什科尔托斯坦共和国\n" +
                "49\n" +
                "布里亚特共和国\n" +
                "15\n" +
                "达吉斯坦共和国\n" +
                "4\n" +
                "卡尔梅克共和国\n" +
                "1\n" +
                "科米共和国\n" +
                "2\n" +
                "克里米亚共和国\n" +
                "7\n" +
                "马里埃尔共和国\n" +
                "1\n" +
                "莫尔多瓦共和国\n" +
                "1\n" +
                "萨哈共和国（雅库特）\n" +
                "1\n" +
                "北奥塞梯-阿拉尼亚共和国\n" +
                "2\n" +
                "鞑靼斯坦共和国\n" +
                "87\n" +
                "哈卡斯共和国\n" +
                "1\n" +
                "俄罗斯\n" +
                "罗斯托夫地区\n" +
                "62\n" +
                "梁赞地区\n" +
                "11\n" +
                "和\n" +
                "萨马拉地区\n" +
                "50\n" +
                "圣彼得堡\n" +
                "375\n" +
                "萨拉托夫地区\n" +
                "11\n" +
                "萨哈林地区\n" +
                "2\n" +
                "斯维尔德洛夫斯克州\n" +
                "131\n" +
                "斯摩棱斯克地区\n" +
                "4\n" +
                "斯塔夫罗波尔地区\n" +
                "20\n" +
                "时间\n" +
                "坦波夫地区\n" +
                "3\n" +
                "特维尔地区\n" +
                "5\n" +
                "托木斯克州\n" +
                "18\n" +
                "图拉地区\n" +
                "27\n" +
                "秋明地区\n" +
                "40\n" +
                "乌德穆尔特共和国\n" +
                "54\n" +
                "乌里扬诺夫斯克州\n" +
                "10\n" +
                "X\n" +
                "哈巴罗夫斯克地区\n" +
                "82\n" +
                "汉特-曼西自治区-尤格拉\n" +
                "36\n" +
                "车里雅宾斯克州\n" +
                "63\n" +
                "车臣共和国\n" +
                "1\n" +
                "楚瓦什共和国\n" +
                "6\n" +
                "亚马尔-涅涅茨自治区\n" +
                "6\n" +
                "雅罗斯拉夫尔地区\n" +
                "11";
    }

    private static String getData1() {
        return "汽车业务637\n" +
                "酒店、餐厅、餐饮、餐饮107\n" +
                "政府机构54\n" +
                "采掘业36\n" +
                "住房和公共服务7\n" +
                "信息技术、系统集成、互联网192\n" +
                "艺术、文化1\n" +
                "林业、木工13\n" +
                "医学、药品、药房52\n" +
                "冶金、金属加工69\n" +
                "石油和天然气150\n" +
                "教育机构198\n" +
                "社会活动、聚会、慈善机构、非政府组织5\n" +
                "交通运输、物流、仓储、外贸343\n" +
                "食物61\n" +
                "工业设备、机械、机器和部件340\n" +
                "零售276\n" +
                "媒体、营销、广告、BTL、公关、设计、制作92\n" +
                "农业38\n" +
                "建筑、房地产、运营、设计330\n" +
                "电信、通讯28\n" +
                "消费品（非食品）219\n" +
                "重型工程40\n" +
                "多资产管理6\n" +
                "商业服务331\n" +
                "为民众服务46\n" +
                "金融业81\n" +
                "化学生产、化肥52\n" +
                "电子、仪器制造、家用电器、计算机和办公设备176\n" +
                "能源48";
    }
}
