package nowcoder;
/*
 牛客题霸-名企高频面试题
寻找峰值
时间限制：C/C++ 1秒，其他语言2秒 空间限制：C/C++ 256M，其他语言512M 热度指数：1270
本题知识点： 数组 二分
 算法知识视频讲解
题目描述
山峰元素是指其值大于或等于左右相邻值的元素。给定一个输入数组nums，任意两个相邻元素值不相等，数组可能包含多个山峰。找到索引最大的那个山峰元素并返回其索引。

假设 nums[-1] = nums[n] = -∞。

示例1
输入
复制
[2,4,1,2,7,8,4]
输出
复制
5
题解 讨论 通过的代码笔记 纠错 收藏
 */


public class NC107 {
    static public class Solution {
        /**
         * 寻找最后的山峰
         *
         * @param a int整型一维数组
         * @return int整型
         */
        public int solve(int[] a) {
            int ans = 0;
            for (int i = 1; i < a.length; i++) {
                if (i + 1 < a.length && a[i] >= a[i + 1] && a[i] >= a[i - 1]) {
                    ans = i;
                } else if (a[i] >= a[i - 1]) {
                    ans = i;
                }
            }
            return ans;
        }
    }

    public static void main(String[] args) {
        int[] nums = {2, 51, 12, 95, 42, 52, 76, 77, 23, 81, 71, 41, 2, 23, 43, 4, 64, 22, 71, 96, 1, 87, 51, 91, 67, 16, 58, 11, 44, 38, 63, 14, 4, 69, 88, 49, 92, 91, 9, 15, 17, 74, 21, 91, 24, 78, 62, 50, 82, 26, 53, 18, 25, 14, 94, 79, 44, 11, 36, 38, 44, 53, 9, 34, 58, 6, 50, 82, 81, 50, 36, 1, 6, 61, 9, 47, 33, 47, 84, 41, 57, 48, 73, 18};
        System.out.println(new Solution().solve(nums));
    }
}
